---
title: Bug Check 0xA0 INTERNAL_POWER_ERROR
description: The INTERNAL_POWER_ERROR bug check has a value of 0x000000A0. This bug check indicates that the power policy manager experienced a fatal error.
keywords: ["Bug Check 0xA0 INTERNAL_POWER_ERROR", "INTERNAL_POWER_ERROR"]
ms.date: 12/09/2020
topic_type:
- apiref
api_name:
- INTERNAL_POWER_ERROR
api_type:
- NA
ms.localizationpriority: medium
---

# Bug Check 0xA0: INTERNAL\_POWER\_ERROR

The INTERNAL\_POWER\_ERROR bug check has a value of 0x000000A0. This bug check indicates that the power policy manager experienced a fatal error.

> [!IMPORTANT]
> This topic is for programmers. If you are a customer who has received a blue screen error code while using your computer, see [Troubleshoot blue screen errors](https://www.windows.com/stopcode).

## INTERNAL\_POWER\_ERROR Parameters


Parameter 1 indicates the type of violation. The meaning of the other parameters depends on the value of Parameter 1.

<table>
<colgroup>
<col width="20%" />
<col width="20%" />
<col width="20%" />
<col width="20%" />
<col width="20%" />
</colgroup>
<thead>
<tr class="header">
<th align="left">Parameter 1</th>
<th align="left">Parameter 2</th>
<th align="left">Parameter 3</th>
<th align="left">Parameter 4</th>
<th align="left">Cause</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td align="left"><p>0x1</p></td>
<td align="left"><p><strong>1:</strong> A device has overrun its maximum number of reference counts.</p>

<td align="left"><p>PDC System Idle Phase (NoCsPhase) has been blocking transition to Modern Standby for a longer time than expected.</p></td>
</tr>
<tr class="odd">
<td align="left"><p>0x900</p></td>
<td align="left"><p>Pointer to the responsible power-setting callback</p></td>
<td align="left"><p>IRQL before calling the power-setting callback</p></td>
<td align="left"><p>IRQL after returning from the power-setting callback</p></td>
<td align="left"><p> A registered power-setting callback returned with modified IRQL. This indicates that the callback changed the IRQL but did not restore the original IRQL before returning.</p></td>
</tr>
<tr class="even">
<td align="left"><p>0x901</p></td>
<td align="left"><p>DEVICE_OBJECT</p></td>
<td align="left"><p>IRP</p></td>
<td align="left"><p>The thread's APC disable count</p></td>
<td align="left"><p>A driver has enabled/disabled kernel APCs while handling a power IRP.</p></td>
</tr>
<tr class="odd">
<td align="left"><p>0x4001</p></td>
<td align="left"><p>KE error subcode.</p>
<p>VALUES:</p>
<p>0x100 : (INTERNAL_POWER_ERROR_KE_PROCESSOR_ON_TIMED_OUT) The firmware took too long to power on a processor.</p>
<p>0x101 : (INTERNAL_POWER_ERROR_KE_INVALID_INTERRUPT_TARGET) An invalid interrupt target was specified.</p>
<p>0x102 : (INTERNAL_POWER_ERROR_KE_SETDESTINATION_FAILED) Failed to change the target destination of an
interrupt line.</p>
<p>0x103 : (INTERNAL_POWER_ERROR_KE_IPI_REQUEST_FAILED) Failed to issue an IPI while an interrupt is being redirected.</p>
<p>0x104 : (INTERNAL_POWER_ERROR_KE_ARCH_NOT_SUPPORTED) Unsupported processor architecture.</p></td>
<td align="left"><p>Reserved</p></td>
<td align="left"><p>Reserved</p></td>
<td align="left"><p>(INTERNAL_POWER_ERROR_KE_SUBCODE) An internal failure has occured in kernel executive during a power operation.</p></td>
</tr>
<tr class="even">
<td align="left"><p>0xAA64</p></td>
<td align="left"><p>Error Code</p></td>
<td align="left"><p>PSCI Function ID in progress</p></td>
<td align="left"><p>Optional internal context dependent data</p></td>
<td align="left"><p>AArm64 Power State Coordination Interface (PSCI) function encountered an unrecoverable critical error.</p></td>
</tr>
</tbody>
</table>

## Resolution

**General Notes**

In the preceding table, several of the parameters are pointers to structures. For example, if Parameter 2 is listed as DEVICE\_OBJECT, then Parameter 2 is a pointer to a DEVICE\_OBJECT structure. Some of the structures are defined in wdm.h, which is included in the Windows Driver Kit. For example, the following structures are defined in wdm.h.

-   EXCEPTION\_POINTERS
-   DEVICE\_OBJECT
-   IO\_STACK\_LOCATION
-   PEP\_DEVICE\_REGISTER

Some of the structures that appear in the preceding table are not defined in any public header file. You can see the definitions of those structures by using the [**dt**](dt--display-type-.md) debugger command. The following example shows how to use the **dt** command to see the **DEVICE\_OBJECT\_POWER\_EXTENSION** structure.

```dbgcmd
3: kd> dt nt!DEVICE_OBJECT_POWER_EXTENSION
   +0x000 IdleCount        : Uint4B
   +0x004 BusyCount        : Uint4B
   +0x008 BusyReference    : Uint4B
   +0x00c TotalBusyCount   : Uint4B
   +0x010 ConservationIdleTime : Uint4B
   +0x014 PerformanceIdleTime : Uint4B
   +0x018 DeviceObject     : Ptr64 _DEVICE_OBJECT
   +0x020 IdleList         : _LIST_ENTRY
   +0x030 IdleType         : _POP_DEVICE_IDLE_TYPE
   +0x034 IdleState        : _DEVICE_POWER_STATE
   +0x038 CurrentState     : _DEVICE_POWER_STATE
   +0x040 Volume           : _LIST_ENTRY
   +0x050 Specific         : <unnamed-tag>
```

The following procedures will help you debug certain instances of this bug check.

<span id="parameter-1-equals-0x2"></span><span id="PARAMETER-1-EQUALS-0X2"></span>
**Debugging bug check 0xA0 when Parameter 1 equals 0x2**

1.  Examine the stack. Look for the **ntoskrnl!PopExceptionFilter** function. This function contains the following code as its first argument.

    ```cpp
     (error_code << 16) | _LINE_
    ```

    If the caller is **PopExceptionFilter**, the first argument to this function is of type PEXCEPTION\_POINTERS. Note the value of this argument.

2.  Use the [**dt (Display Type)**](dt--display-type-.md) command and specify the value that you found in the previous step as *argument*.

    ```dbgcmd
    dt nt!_EXCEPTION_POINTERS argument 
    ```

    This command displays the structure. Note the address of the context record.

